{"sections":{"main":{"type":"page-grant-redesign","settings":{"main_hero_title":"the nomz grant","main_hero_subtitle":"We are happy to announce that applications are open for our third annual nomz grant are now open. This grant will provide a total of $10,000 ($5,000 each) to two Indigenous individuals to pursue their dreams of starting or growing a business. <p><a href=\"https:\/\/aoj2xwf72tl.typeform.com\/to\/BmrbBzUZ?typeform-source=admin.typeform.com\" target=\"_blank\">CLICK HERE TO APPLY NOW<\/a><\/p>","main_hero_img":"shopify:\/\/shop_images\/nomz_grant_header.png","main_hero_img_sm":"shopify:\/\/shop_images\/nomz_grant_header.png","section_2_title":"How It Started","section_2_text":"<p>The summer before nomz began, our founder Jana had the opportunity to spend the summer months with the Moose Cree First Nations in Moose Factory, Ontario. This was a transformative time filled with beauty, learning, and growth.<\/p>\n\n<p>Slowing down, the connection to the earth and appreciation for simplicity inspired our mission – to help people eat and live better, across Canada and beyond. That’s why we’re passionate about sourcing ingredients in their most whole, natural form – and crafting nourishing snacks that are organic, free from refined sugar, and made with only pure, simple ingredients.<\/p>\n\n<p>Walking away from her summer, Jana knew that she wanted to create something to give back to the people and places that inspired her during those summer months. As a purpose-driven team – giving back to the community and recognizing those who have inspired and supported us along the way has always been important.<\/p>","section_2_img":"shopify:\/\/shop_images\/canoe-4.jpg","section_3_title":"How To Apply","section_3_text":"<p> To apply, please fill out the  <a href=\"https:\/\/aoj2xwf72tl.typeform.com\/to\/BmrbBzUZ?typeform-source=admin.typeform.com\" target=\"_blank\">application form <\/a> by September 2, 2022. The recipient of the grant will be announced on September 15, 2022. <\/p> \n\n<p>If you applied in previous years, you can apply again this year. All applications will be properly vetted through a selection committee with individuals from the Indigenous community, including the previous grant recipients.⁠ <\/p>\n\n<p>The Philanthropic Community's Declaration of Action can be read by clicking here. It is a commitment by organizations like us who are offering support to the Indigenous community, to do so in an atmosphere of understanding, dignity and respect towards the shared goal of reconciliation, an atmosphere of understanding, dignity and respect towards the shared goal of reconciliation.<\/p>\n\n<p><a href=\"https:\/\/aoj2xwf72tl.typeform.com\/to\/BmrbBzUZ?typeform-source=admin.typeform.com\" target=\"_blank\">CLICK HERE TO APPLY NOW<\/a><\/p>","section_3_img":"shopify:\/\/shop_images\/857A1883-Edit2.jpg","section_4_main_title":"Recipients Of The Grant","section_4_title":"2020 Grant Recipient","section_4_text":"We are happy to announce Endaayaan Awejaa as the recipient of the 2020 nomz grant!","section_4_more_title":"","section_4_more_text":"<p>This was a unanimous decision by the Indigenous Selection Committee which evaluated the applications based on their ability to positively impact Canada's Indigenous community.<\/p>\n\n<p>Endaayaan Awejaa, started by Strong Earth Woman (spirit name) Natasha Lariviere (English name) from Nipissing First Nation, is a non-profit organization started to empower youth with the message that they can go anywhere and do anything their hearts want​,​ and that home is a feeling inside​​ while providing a safe place to learn, heal and grow into the person they dream to be. They offer community outreach programming through arts and culture, reconciliation, education and harm reduction to help with overall wellness which includes emotional, physical, mental and spiritual wellness.<\/p>\n\n<p>“This nomz grant helped us kick off our annual winter gear drive. We were able to support 10 youth with new winter gear. This also helped us provide care packages and art workshops when we were first starting off. We were able to support youth with medicine bundles as well to help them reconnect with culture.”<\/p>\n\n<p>Thank you to all who applied, and thank you to Cindy, Florence and Allen for all your time vetting through these thoughtful and inspiring applications.<\/p><p>\n\n<\/p><p>Where to find Endaayaan Awejaa:<\/p><p>\n\n<\/p><p><a href=\"https:\/\/www.instagram.com\/endaayaan_awejaa\/\" target=\"_blank\">@endaayaan_awejaa <\/a><\/p>\n\n<p><a href=\"https:\/\/www.endaayaanawejaa.com\/\" target=\"_blank\">endaayaanawejaa.com <\/a><\/p>","section_4_img":"shopify:\/\/shop_images\/Photo1_sapling_Nwsrm.jpg","section_5_title":"2021 Grant Recipient","section_5_text":"Congratulations to Sapling & Flint, the recipient of the second annual nomz grant!","section_5_more_title":"","section_5_more_text":"Twin sisters and proud Mohawk mothers, Teyotsihstokwáthe Dakota Brant and Yonenyà:kenht Jesse Brant co-founded Sapling & Flint, a jewellery manufacturing company specializing in conversation pieces that share the story of Turtle Island and share insight to Haudenosaunee culture and history. \nStarting in 2017 – Sapling & Flint design, make, and sell in their home community of Six Nations of the Grand River territory. Through their work, they seek to create jobs for community creatives in their home village of Ohswé:ken, raise the profile of Indigenous art, fashion and design, and bring authentic Indigenous designed and made products nationwide.\nThank you to all who applied and shared their stories with us, and thank you to the Indigenous selection committee for their time vetting these inspiring applications.\n\n<p>Where to find Sapling and Flint:<\/p>\n\n<p><a href=\"https:\/\/www.instagram.com\/saplingandflint\/\" target=\"_blank\">@saplingandflint<\/a><\/p>\n\n<p><a href=\"https:\/\/www.saplingandflint.ca\/\" target=\"_blank\">saplingandflint.ca<\/a><\/p>","section_5_img":"shopify:\/\/shop_images\/Photo1_sapling_Nwsrm.png","section_6_title":"Questions?","section_6_subtitle":"","section_6_img":"shopify:\/\/shop_images\/Bites_assorted.jpg"}}},"order":["main"]}