{"sections":{"main":{"type":"page-energy-bites-landing","blocks":{"d75f5d4e-79cf-435b-8635-6436a80239da":{"type":"ingredient","settings":{"image":"shopify:\/\/shop_images\/hazelnut_1880e4c8-a610-4988-bf48-84132d32aa8b.jpg","title":"Hazelnuts","text":"<p>Delicious and nutritious! Hazelnuts’ high level of vitamin E make them powerful cancer-fighting foods, boost the brain, and contribute to healthy skin and hair.<\/p>"}},"86820e72-2ca8-45cd-a3cd-8bf63021ee3d":{"type":"ingredient","settings":{"image":"shopify:\/\/shop_images\/almonds_1.jpg","title":"Almonds","text":"<p>These power-packed nuts have healthy fats, fiber, protein, magnesium and vitamin E. Plus, raw and roasted almonds are prebiotic and support the gut microbiome.<\/p>"}},"0e62d21d-70fb-4905-ba5f-111d5cee2c18":{"type":"ingredient","settings":{"image":"shopify:\/\/shop_images\/cocoa_bfaa399b-69ce-456f-9a28-a13afbfaac6f.jpg","title":"Fair Trade Cocoa","text":"<p>Cocoa is packed with polyphenols, a naturally occurring antioxidant, known to improve blood flow and supply to your brain, neuron creation, and brain function.<\/p>"}},"0cd3209d-5801-4dc3-87c3-0de13241a447":{"type":"ingredient","settings":{"image":"shopify:\/\/shop_images\/dates_1.jpg","title":"Dates","text":"<p>By weight, dates contain 50% more potassium than bananas. One of seven essential macrominerals – potassium helps send nerve signals and regulate fluid balance.<\/p>"}},"eecc80a3-b1de-4d33-a0bd-560d5e92402d":{"type":"ingredient","settings":{"image":"shopify:\/\/shop_images\/sea_salt_93526c5c-2244-4f91-bc4a-64838c83b12b.jpg","title":"Sea Salt","text":"<p>Sea salt is natural source of sodium loaded with electrolytes. Sea salt nourishes adrenal glands, improves dental health, and prmotes Nutrient Absorption.<\/p>"}}},"block_order":["d75f5d4e-79cf-435b-8635-6436a80239da","86820e72-2ca8-45cd-a3cd-8bf63021ee3d","0e62d21d-70fb-4905-ba5f-111d5cee2c18","0cd3209d-5801-4dc3-87c3-0de13241a447","eecc80a3-b1de-4d33-a0bd-560d5e92402d"],"settings":{"product-landing-title":"5 Reasons Why Our Hazelnut Energy Bites Have Over 1000 Five Star Reviews","product-landing-subtitle":"Here are the top 5 reasons why thousands of people are choosing our guilt-free, no added sugar, nutrient-dense, absolutely delicious hazelnut energy bites!","reason-title-1":"Taste + Texture","reason-title-1-mb":"1. Taste + Texture","reason-text-1":"Crunchy hazelnuts on the outside and the texture of a soft, fudgy brownie on the inside – it’s no wonder our hazelnut energy bites are our #1 seller! The combination of taste and texture is pure sweet, nutty, chocolatey goodness.\n\nSo good in fact, these velvety hazelnut bites are constantly compared to Ferrero Rocher! But the word on the street is, our bites taste even better – and they’re healthy.","reason-img-1":"shopify:\/\/shop_images\/IMGL3517-Edit-2.jpg","reason-title-2":"Curb Your Cravings","reason-title-2-mb":"2. Curb Your Cravings Without The Added Sugar","reason-text-2":"Satisfy your craving without compromising your health. We are 100% refined sugar-free! We sweeten our energy bites naturally with dates. Along with being a natural sugar, dates are very high in fibre – helping you stay full for longer. \n\nWhether you’re looking for a mid-afternoon pick-me-up, some dessert after dinner, or a sweet treat for your little picky eaters – we’ve got you covered. \n\nEvery single bite of our hazelnut energy bites is packed with fibre, healthy fats and protein making them a perfectly balanced snack – guaranteed to leave you feeling satisfied and refueled.","reason-img-2":"shopify:\/\/shop_images\/hazelnut_square_2.jpg","reason-title-3":"Certified Organic + Natural Ingredients","reason-title-3-mb":"3. Certified Organic + Natural Ingredients","reason-text-3":"We know that what you put in your body is important – that’s why we are committed to sourcing the world’s best organic ingredients and proud to be made in Canada.  We’re certified organic, vegan, gluten-free, and paleo. As for the ingredients? What you see is what you get! No fillers or hidden ingredients. \nOur hazelnut energy bites are made with only five pure, simple ingredients – hazelnuts, dates, almonds, free trade cocoa, and sea salt.","reason-img-3":"shopify:\/\/shop_images\/hazelnuts_ingredient_square.jpg","reason-title-4":"Convenience That Can’t Be Beat","reason-title-4-mb":"4. Convenience That Can’t Be Beat","reason-text-4":"Daily Nourish contains a substantial dose of bioavailable vitamin C per serving (110 mg) - thanks to a combination of camu camu, amla berry, moringa, and spirulina. These plant based superfoods contain numerous phytochemicals that act as antioxidants including polyphenols, flavanols, anthocyanin, catechin, and more! Antioxidants are a key component for longevity and health - helping the body to fight oxidative stress and neutralize free radicals. BONUS: Vitamin C aids the absorption of iron, making this an ideal pairing with the organic curry leaf.","reason-img-4":"shopify:\/\/shop_images\/snack-bites-square.jpg","reason-title-5":"100% Happiness Guarantee","reason-title-5-mb":"5. 100% Happiness Guarantee","reason-text-5":"We’re lucky to have 1,000s of happy customers – in fact, we’re confident you’ll be one too! That is why we offer a happiness guarantee. If you’re not 100% satisfied with your order – reach out to hello@nomz.com and we’ll send you a full refund.","reason-img-5":"shopify:\/\/shop_images\/hazelnut_bites_square.jpg","testimonial-title-1":"Yum!!","testimonial-text-1":"“For one unable to eat refined sugar I am thrilled to have found these. They are so rich and complex in flavor I look forward to this treat everyday!”","testimonial-author-1":"Lisa J.","testimonial-author-stat-1":"Verified Buyer","testimonial-title-2":"I Could Live On These","testimonial-text-2":"“I could live on these. I have the WORST time getting up in the morning. These little pockets of goodness are not only super easy to just grab in the morning without having to prepare anything, they're so tasty that they're a very good motivator to help me outta bed on those bad days.”","testimonial-author-2":"Carley M","testimonial-author-stat-2":"Verified Reviewer","testimonial-title-3":"It is amazing!","testimonial-text-3":"“I picked these up at a coffee shop and loved them so much I went home and immediately ordered a box!”","testimonial-author-3":"Nanci B.","testimonial-author-stat-3":"Verified Buyer","testimonial-video":"https:\/\/cdn.shopify.com\/s\/files\/1\/0857\/4434\/files\/hazelnut_bites.mp4?v=1655235402","ingredient-section-head":"The Ingredients","dn-discount-h5":"AN EXCLUSIVE DISCOUNT","dn-discount-h2":"Save 10% Instantly","dn-discount-p":"Say thank you to your body – and everything it does for you! Add these delicious and healthy hazelnut energy bites your cart today – and enjoy whenever your sweet cravings strike! For a limited time only, we’re offering an exclusive discount on our Hazelnut Energy Bites. What are you waiting for?!","dn-discount-a":"UNLOCK 10% OFF HAZELNUT ENERGY BITES"}}},"order":["main"]}